src/Documents/АктПривязкиМарокЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>АктПривязкиМарокЕГАИС</Name>
			<BasedOn>
				<xr:Item>Document.ВозвратОтПокупателя</xr:Item>
				<xr:Item>Document.ПеремещениеТоваров</xr:Item>
				<xr:Item>Document.ПоступлениеТоваров</xr:Item>
				<xr:Item>Document.ВозвратПоставщику</xr:Item>
				<xr:Item>Document.РеализацияТоваров</xr:Item>
				<xr:Item>Document.Инвентаризация</xr:Item>
				<xr:Item>Document.ИнвентаризацияАлкогольнойПродукцииЕГАИС</xr:Item>
				<xr:Item>Document.ПеремещениеВТорговыйЗалЕГАИС</xr:Item>
				<xr:Item>Document.ТоварноТранспортнаяНакладнаяВходящаяЕГАИС</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиМарокЕГАИС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтатус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыОбработкиЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСостояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияДокументовЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Comment>Регистрационный номер акта постановки на баланс</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ТоварноТранспортнаяНакладнаяВходящаяЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеВТорговыйЗалЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АлкогольнаяПродукция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Справка2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьНомерСправки2</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Марки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодМарки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НовыйКодМарки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/СтатусыДокументовЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СтатусыДокументовЕГАИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусОбработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыОбработкиЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСтатуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтатусовОбработкиЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДальнейшееДействие1</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДальнейшиеДействияЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДальнейшееДействие2</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДальнейшиеДействияЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДальнейшееДействие3</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДальнейшиеДействияЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КвитанцияДоставлена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КвитанцияВыполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УведомлениеОРегистрацииДвижения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТоварноТранспортнаяНакладнаяВходящаяЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ДобавлениеАлкоподукцииЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеВТорговыйЗалЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОбИмпортеПродукцииЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ДобавлениеОрганизацииЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.АктСписанияЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ТоварноТранспортнаяНакладнаяИсходящаяЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.АктПостановкиНаБалансЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.АктПривязкиМарокЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеСмены</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗапросМарокЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияАлкогольнойПродукцииЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПроверкаОстатковМарокВЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОстаткиЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОстаткиМарокЕГАИС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеГрупповойТарыЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/AccumulationRegisters/ОстаткиМарокЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиМарокЕГАИС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КодМарки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОрганизацияЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Справка2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/ДальнейшиеДействияЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ДальнейшиеДействияЕГАИС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеТребуется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередайтеДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтвердитеАктОРасхождениях</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОткажитесьОтАктаОРасхождениях</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапроситеОстатки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапроситеАкцизныеМарки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапроситеОтчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОткажитесьОтНакладной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполнитеПроверку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтвердитеПолучение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтвердитеПолучениеАктПодтверждения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтвердитеПолучениеАктРасхождений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапроситеОтменуПроведения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтвердитеЗапросНаОтменуПроведения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОткажитесьОтЗапросаНаОтменуПроведения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменитеОперацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменитеПередачуДанных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполнитеОбмен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидайтеПередачуДанныхРегламентнымЗаданием</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидайтеПолучениеКвитанцииПолученЕГАИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидайтеПолучениеКвитанцииПроведенЕГАИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидайтеПолучениеУведомленияОРегистрацииДвижения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидайтеПолучениеОстатков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидайтеПолучениеАкцизныхМарок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидайтеПолучениеОтчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидайтеПолученияПодтверждения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтработайтеРасхождения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформитеПоступление</Name>
					<Comment>Оформите поступление</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередайтеАктПодтверждения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершитеФормированиеГрупповойТары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СгенерируйтеКодыУпаковок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполнитеПеремещениеИзТорговогоЗала</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидайтеПеремещениеИзТЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазрешитеОтправкуТТН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапроситеАлкогольнуюПродукцию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапроситеОрганизациюЕГАИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидайтеПолучениеАлкогольнойПродукции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидайтеПолучениеОрганизацииЕГАИС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВходящееИсходящееСобытие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВходящееИсходящееСобытие</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Входящее</Name>
					<Comment>Входящее сообщение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящее</Name>
					<Comment>Исходящее сообщение</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/АктПривязкиМарокЕГАИС/Ext/ManagerModule.bsl
// Модуль менеджера документа "Акт привязки марок ЕГАИС"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Производит расчет значений итоговых показателей по операции в целом.
//
// Параметры:
//  Объект      - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  Расширенные - Булево               - Признак получения расширенных сведений об итогах операции.
//
Функция РассчитатьИтогиОперации(Объект, Расширенные=ЛОЖЬ) Экспорт
	
	// Формируем перечень основной информации об итогах операции
	ИтогиОперации = Новый Структура();
	ИтогиОперации.Вставить("СуммаДокумента", 0);
	
	// Возвращаем сведения об итогах операции
	Возврат ИтогиОперации;
	
КонецФункции // РассчитатьИтогиОперации()

// Производит расчет значений итоговых показателей по операции в целом.
//
// Параметры:
//  Объект      - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  Расширенные - Булево               - Признак получения расширенных сведений об итогах операции.
//
Функция АктПривязкиМарокЕГАИСXML(ДокументСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	АктПривязкиМарокЕГАИС.ХозОперация,
	|	АктПривязкиМарокЕГАИС.ОрганизацияЕГАИС,
	|	АктПривязкиМарокЕГАИС.ОрганизацияЕГАИС.Код КАК ИдентификаторФСРАР,
	|	АктПривязкиМарокЕГАИС.Идентификатор КАК Идентификатор,
	|	АктПривязкиМарокЕГАИС.Номер,
	|	АктПривязкиМарокЕГАИС.Дата,
	|	ВЫРАЗИТЬ(АктПривязкиМарокЕГАИС.Комментарий КАК Строка(500)) КАК Комментарий,
	|	АктПривязкиМарокЕГАИС.Товары.(
	|		АлкогольнаяПродукция,
	|		АлкогольнаяПродукция.Упакована КАК Упакована,
	|		АлкогольнаяПродукция.ВидПродукции.ВидЛицензии КАК ВидЛицензии,
	|		Справка2.Номер КАК НомерСправки2,
	|		НомерСтроки,
	|		ИдентификаторСтроки
	|	) КАК Товары,
	|	АктПривязкиМарокЕГАИС.Марки.(
	|	КодМарки,
	|	НовыйКодМарки,
	|	ИдентификаторСтроки
	|	) КАК Марки
	|ИЗ
	|	Документ.АктПривязкиМарокЕГАИС КАК АктПривязкиМарокЕГАИС
	|ГДЕ
	|	АктПривязкиМарокЕГАИС.Ссылка = &Ссылка И 
	|	АктПривязкиМарокЕГАИС.ПометкаУдаления = ЛОЖЬ
	|";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		
		ПараметрыОбменов  = ИнтеграцияЕГАИСПовтИсп.ПолучитьПараметрыОбменов();
		ПараметрыОбъектов = ПараметрыОбменов.ПараметрыОбъектов;
		
		ПараметрыЗапроса = ПараметрыОбъектов[Перечисления.ВидыОбъектовЕГАИС.АктФиксацииМарок];
		
		СообщенияXML = Новый Массив;
		
		СообщениеXML = ИнтеграцияЕГАИС.СтруктураСообщенияXML();
		СообщениеXML.Описание = ПараметрыЗапроса.Описание;
		
		ИнтеграцияГосИС.ДобавитьТекстОшибки(СообщениеXML, НСтр("ru = 'Нет данных для выгрузки.'"));
		СообщенияXML.Добавить(СообщениеXML);
		
		Возврат СообщенияXML;
		
	КонецЕсли;
	
	Если Выборка.ХозОперация = Справочники.ХозОперации.АктПривязкиМарокЕГАИС Тогда
		ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктФиксацииМарок;
	ИначеЕсли Выборка.ХозОперация = Справочники.ХозОперации.АктПересортицыМарокЕГАИС Тогда
		ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктФиксацииМарок;
	Иначе
		ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктОтменыФиксацииМарок;
	КонецЕсли;
	
	Товары = Выборка.Товары.Выгрузить();
	Если Товары.Количество() = 0 Тогда
		
		ПараметрыОбменов  = ИнтеграцияЕГАИСПовтИсп.ПолучитьПараметрыОбменов();
		ПараметрыОбъектов = ПараметрыОбменов.ПараметрыОбъектов;
		ПараметрыЗапроса  = ПараметрыОбъектов[ВидСообщения];
		
		СообщенияXML = Новый Массив;
		
		СообщениеXML = ИнтеграцияЕГАИС.СтруктураСообщенияXML();
		СообщениеXML.Описание = ПараметрыЗапроса.Описание;
		
		ИнтеграцияГосИС.ДобавитьТекстОшибки(СообщениеXML, НСтр("ru = 'Нет данных для выгрузки.'"));
		СообщенияXML.Добавить(СообщениеXML);
		
		Возврат СообщенияXML;
		
	КонецЕсли;
	
	ДанныеДляВыгрузки = Новый Структура;
	ДанныеДляВыгрузки.Вставить("ИдентификаторФСРАР", Выборка.ИдентификаторФСРАР);
	ДанныеДляВыгрузки.Вставить("Объект",             ДокументСсылка);
	ДанныеДляВыгрузки.Вставить("ШапкаДокумента",     Выборка);
	ДанныеДляВыгрузки.Вставить("ТаблицаТоваров",     Товары);
	ДанныеДляВыгрузки.Вставить("ТаблицаМарок", Выборка.Марки.Выгрузить());
	
	СообщенияXML = ИнтеграцияЕГАИС.СформироватьСообщенияXML(ВидСообщения, ДанныеДляВыгрузки, 2);
	
	Возврат СообщенияXML;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ПАРАМЕТРЫ ОБРАБОТКИ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Массив();
	ОбязательныеРеквизиты.Добавить("Организация");
	ОбязательныеРеквизиты.Добавить("ПодразделениеКомпании");
	ОбязательныеРеквизиты.Добавить("ОрганизацияЕГАИС");
	
	Если НЕ ПравоПользователя("ПроведениеНезаполненныхДокументов", Объект) Тогда
		ОбязательныеРеквизиты.Добавить("Товары");
		ОбязательныеРеквизиты.Добавить("Марки");
	КонецЕсли; 
	
	ОбязательныеРеквизиты.Добавить("Марки.КодМарки");
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Уникальные поля таблицы товаров
	УникальныеТовары=Новый Массив();
	УникальныеТовары.Добавить("Справка2");
	
	// Уникальные поля таблицы марки
	УникальныеМарки=Новый Массив();
	УникальныеМарки.Добавить("КодМарки");
	
	// Структура уникальных реквизитов табличных частей
	УникальныеРеквизиты = Новый Структура();
	УникальныеРеквизиты.Вставить("Товары", УникальныеТовары);
	УникальныеРеквизиты.Вставить("Марки", УникальныеМарки);
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьУникальныеРеквизиты()


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ИЗМЕНЕНИЯ ДАННЫХ ОБЪЕКТА

// Возвращает предопределенную структуру действий
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Функция ПолучитьПараметрыДействия(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Если ПараметрыДействия=Неопределено Тогда
		ПараметрыДействия = Новый Структура;
	КонецЕсли;
	
	// Производим добавление параметров расширяемых контекст обработки событий объекта
	ПараметрыДействия.Вставить("ОбъектЗаполнен", Объект.Товары.Количество() > 0);
	
	Возврат ПараметрыДействия;
	
КонецФункции // ПолучитьПараметрыДействия()

// Обработчик события пересчета зависимых показателей объекта при изменении значений ведущих реквизитов.
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик действия
	ОбработкаРеквизитовДокументаСервер.ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаПересчетаПоказателейОбъекта()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ

// Обработчик события возникающего при изменении данных реквизита "Дата".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДатаПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ДатаПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ДатаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Организация".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОрганизацияПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ОрганизацияПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Автор".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура АвторПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.АвторПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Документ основание".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДокументОснованиеПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ДокументОснованиеПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ДокументОснованиеПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ХозОперацияПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Прописать проверку соответствия реквизитов объекта выбранной хоз.операции
	ОбработкаРеквизитовДокументаСервер.ХозОперацияПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ХозОперацияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Подразделение компании".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ПодразделениеКомпанииПриИзменении()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ ТАБЛИЦЫ "ТОВАРЫ"

// Обработчик события возникающего при изменении данных реквизита "Алкогольная продукция" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//
Процедура ТоварыАлкогольнаяПродукцияПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	ПараметрыДействия.Вставить("НетНоменклатуры", Истина);
	
	// Вызываем общий обработчик события
	ОбработкаТабличнойЧастиТовары.АлкогольнаяПродукцияПриИзменении(Объект, Строка, ПараметрыДействия);

КонецПроцедуры // ТоварыАлкогольнаяПродукцияПриИзменении()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ ТАБЛИЦЫ "Марки"

// Обработчик события возникающего при изменении данных реквизита "Алкогольная продукция" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//
Процедура МаркиКодМаркиПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	ПараметрыДействия.Вставить("ПроверятьАП", Ложь);
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.МаркиКодМаркиПриИзменении(Объект, Строка, ПараметрыДействия);
		
КонецПроцедуры // МаркиКодМаркиПриИзменении()

////////////////////////////////////////////////////////////////////////////////
// ПРОВЕДЕНИЕ 

Функция ТекстЗапросаОстаткиМарокЕГАИС(ТекстыЗапроса)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&ДатаРегистрации                  КАК Период,
	|	АктПривязкиМарокМарки.Ссылка      КАК Регистратор,
	|	&ОрганизацияЕГАИС                 КАК ОрганизацияЕГАИС,
	|	&ХозОперация                      КАК ХозОперация,
	|	АктПривязкиМарокМарки.НомерСтроки КАК НомерСтроки,
	|	АктПривязкиМарокМарки.КодМарки    КАК КодМарки,
	|	АктПривязкиМарокТовары.Справка2   КАК Справка2,
	|	1 КАК Количество
	|ИЗ
	|	Документ.АктПривязкиМарокЕГАИС.Марки КАК АктПривязкиМарокМарки
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Документ.АктПривязкиМарокЕГАИС.Товары КАК АктПривязкиМарокТовары
	|ПО
	|	АктПривязкиМарокМарки.Ссылка = АктПривязкиМарокТовары.Ссылка И 
	|	АктПривязкиМарокМарки.ИдентификаторСтроки = АктПривязкиМарокТовары.ИдентификаторСтроки И 
	|	(НЕ АктПривязкиМарокМарки.КодМарки = """")
	|ГДЕ
	|	АктПривязкиМарокМарки.Ссылка = &Ссылка И 
	|	&ВидСтатуса В (&ВидыСтатусовДвижений) И 
	|	&ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.АктПривязкиМарокЕГАИС)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&ДатаРегистрации                  КАК Период,
	|	АктПривязкиМарокМарки.Ссылка      КАК Регистратор,
	|	&ОрганизацияЕГАИС                 КАК ОрганизацияЕГАИС,
	|	&ХозОперация                      КАК ХозОперация,
	|	АктПривязкиМарокМарки.НомерСтроки КАК НомерСтроки,
	|	АктПривязкиМарокМарки.КодМарки    КАК КодМарки,
	|	АктПривязкиМарокТовары.Справка2   КАК Справка2,
	|	1 КАК Количество
	|ИЗ
	|	Документ.АктПривязкиМарокЕГАИС.Марки КАК АктПривязкиМарокМарки
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Документ.АктПривязкиМарокЕГАИС.Товары КАК АктПривязкиМарокТовары
	|ПО
	|	АктПривязкиМарокМарки.Ссылка = АктПривязкиМарокТовары.Ссылка И 
	|	АктПривязкиМарокМарки.ИдентификаторСтроки = АктПривязкиМарокТовары.ИдентификаторСтроки И 
	|	(НЕ АктПривязкиМарокМарки.КодМарки = """")
	|ГДЕ
	|	АктПривязкиМарокМарки.Ссылка = &Ссылка И 
	|	&ВидСтатуса В (&ВидыСтатусовДвижений) И 
	|	&ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.АктОтвязкиМарокЕГАИС)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&ДатаРегистрации                    КАК Период,
	|	АктПривязкиМарокМарки.Ссылка        КАК Регистратор,
	|	&ОрганизацияЕГАИС                   КАК ОрганизацияЕГАИС,
	|	&ХозОперация                        КАК ХозОперация,
	|	АктПривязкиМарокМарки.НомерСтроки   КАК НомерСтроки,
	|	АктПривязкиМарокМарки.НовыйКодМарки КАК КодМарки,
	|	АктПривязкиМарокТовары.Справка2     КАК Справка2,
	|	1 КАК Количество
	|ИЗ
	|	Документ.АктПривязкиМарокЕГАИС.Марки КАК АктПривязкиМарокМарки
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Документ.АктПривязкиМарокЕГАИС.Товары КАК АктПривязкиМарокТовары
	|ПО
	|	АктПривязкиМарокМарки.Ссылка = АктПривязкиМарокТовары.Ссылка И 
	|	АктПривязкиМарокМарки.ИдентификаторСтроки = АктПривязкиМарокТовары.ИдентификаторСтроки И 
	|	(НЕ АктПривязкиМарокМарки.КодМарки = """")
	|ГДЕ
	|	АктПривязкиМарокМарки.Ссылка = &Ссылка И 
	|	&ВидСтатуса В (&ВидыСтатусовДвижений) И 
	|	&ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.АктПересортицыМарокЕГАИС)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&ДатаРегистрации                    КАК Период,
	|	АктПривязкиМарокМарки.Ссылка        КАК Регистратор,
	|	&ОрганизацияЕГАИС                   КАК ОрганизацияЕГАИС,
	|	&ХозОперация                        КАК ХозОперация,
	|	АктПривязкиМарокМарки.НомерСтроки   КАК НомерСтроки,
	|	АктПривязкиМарокМарки.КодМарки      КАК КодМарки,
	|	АктПривязкиМарокТовары.Справка2     КАК Справка2,
	|	1 КАК Количество
	|ИЗ
	|	Документ.АктПривязкиМарокЕГАИС.Марки КАК АктПривязкиМарокМарки
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Документ.АктПривязкиМарокЕГАИС.Товары КАК АктПривязкиМарокТовары
	|ПО
	|	АктПривязкиМарокМарки.Ссылка = АктПривязкиМарокТовары.Ссылка И 
	|	АктПривязкиМарокМарки.ИдентификаторСтроки = АктПривязкиМарокТовары.ИдентификаторСтроки И 
	|	(НЕ АктПривязкиМарокМарки.КодМарки = """")
	|ГДЕ
	|	АктПривязкиМарокМарки.Ссылка = &Ссылка И 
	|	&ВидСтатуса В (&ВидыСтатусовДвижений) И 
	|	&ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.АктПересортицыМарокЕГАИС)
	|УПОРЯДОЧИТЬ ПО
	|	АктПривязкиМарокМарки.НомерСтроки
	|";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, "ОстаткиМарокЕГАИС");
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	
	////////////////////////////////////////////////////////////////////////////
	// Сформируем текст запроса
	
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстЗапросаОстаткиМарокЕГАИС(ТекстыЗапроса);
	
	ИнтеграцияЕГАИС.ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДанныеШапки.Дата                  КАК Период,
	|	ДанныеШапки.Ссылка                КАК Ссылка,
	|	ДанныеШапки.ОрганизацияЕГАИС      КАК ОрганизацияЕГАИС,
	|	ДанныеШапки.ДатаРегистрации       КАК ДатаРегистрации,
	|	ДанныеШапки.ХозОперация           КАК ХозОперация,
	|	СтатусыДокументовЕГАИС.ВидСтатуса КАК ВидСтатуса
	|ИЗ
	|	Документ.АктПривязкиМарокЕГАИС КАК ДанныеШапки
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СтатусыДокументовЕГАИС КАК СтатусыДокументовЕГАИС
	|ПО
	|	СтатусыДокументовЕГАИС.Документ = ДанныеШапки.Ссылка
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	Запрос.УстановитьПараметр("Период",               Реквизиты.Период);
	Запрос.УстановитьПараметр("Ссылка",               Реквизиты.Ссылка);
	Запрос.УстановитьПараметр("ВидСтатуса",           Реквизиты.ВидСтатуса);
	Запрос.УстановитьПараметр("ОрганизацияЕГАИС",     Реквизиты.ОрганизацияЕГАИС);
	Запрос.УстановитьПараметр("ДатаРегистрации",      Реквизиты.ДатаРегистрации);
	Запрос.УстановитьПараметр("ХозОперация",          Реквизиты.ХозОперация);
	Запрос.УстановитьПараметр("ВидыСтатусовДвижений", ВидыСтатусовДвижений());
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()


///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ СЕРВИСОВ ЗАПОЛНЕНИЯ ДОКУМЕНТА

// Процедура используется для указания доступного данному виду объектов перечня вариантов заполнения.
//
// Параметры:
//  КомандыЗаполнения - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов заполнения.
//
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения) Экспорт
	
КонецПроцедуры // ДобавитьКомандыЗаполнения()

// Производит формирование структуры с доступностью команд заполнения объекта
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандЗаполнения(Объект) Экспорт
	
	// Команды заполнения могут быть не доступны в зависимости от параметров объекта
	ДоступностьКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры видимости и доступности команд проверки
	Возврат ДоступностьКоманд;
	
КонецФункции // ПолучитьДоступностьКомандЗаполнения()

#Область ДействияПриОбменеЕГАИС

// Статус после подготовки к передаче данных.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.АктПривязкиМарокЕГАИС - Ссылка на документ.
//  ВидСообщения - ПеречислениеСсылка.ВидыОбъектовЕГАИС - ВидСообщения ЕГАИС.
// 
// Возвращаемое значение:
//  Структура - Структура со свойствами:
//   * НовыйСтатус - ПеречисленияСсылка.ВидыСтатусовОбработкиЕГАИС - Новый статус.
//   * ДальнейшееДействие1 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 1.
//   * ДальнейшееДействие2 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 2.
//   * ДальнейшееДействие3 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 3.
//
Функция СтатусПослеПодготовкиКПередачеДанных(ДокументСсылка, ВидСообщения) Экспорт
	
	Если ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктФиксацииМарок
		Или ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктОтменыФиксацииМарок Тогда
		ВидСтатуса = Перечисления.ВидыСтатусовОбработкиЕГАИС.КПередаче;
	Иначе
		ВызватьИсключение ИнтеграцияЕГАИС.ТекстИсключенияОбработкиСтатуса(ДокументСсылка, ВидСообщения);
	КонецЕсли;
	
	ПараметрыОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.РассчитатьСтатусыКПередаче(ДокументСсылка, ВидСтатуса);
	
	Возврат ПараметрыОбновления;
	
КонецФункции

// Статус после передачи данных
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.АктПривязкиМарокЕГАИС - Ссылка на документ
//  ВидСообщения - ПеречислениеСсылка.ВидыОбъектовЕГАИС - Вид сообщения ЕГАИС
//  СтатусОбработки - ПеречислениеСсылка.СтатусыОбработкиСообщенийЕГАИС - Статус обработки сообщения
// 
// Возвращаемое значение:
//  Структура - Структура со свойствами:
//   * СтатусОбработки - ПеречисленияСсылка.ВидыСтатусовОбработкиЕГАИС - Новый статус.
//   * ДальнейшееДействие1 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 1.
//   * ДальнейшееДействие2 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 2.
//   * ДальнейшееДействие3 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 3.
//
Функция СтатусПослеПередачиДанных(ДокументСсылка, ВидСообщения, СтатусОбработки) Экспорт
	
	Если ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктФиксацииМарок
		Или ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.АктОтменыФиксацииМарок Тогда
		
		ВидыСтатусовБазовыйПроцесс = РегистрыСведений.СтатусыДокументовЕГАИС.СтруктураСтатусы();
		
		ВидыСтатусовБазовыйПроцесс.Принят = Перечисления.ВидыСтатусовОбработкиЕГАИС.ПереданВУТМ;
		ВидыСтатусовБазовыйПроцесс.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОжидайтеПолучениеКвитанцииПолученЕГАИС);
		ВидыСтатусовБазовыйПроцесс.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОжидайтеПолучениеКвитанцииПроведенЕГАИС);
		
		ВидыСтатусовБазовыйПроцесс.Ошибка = Перечисления.ВидыСтатусовОбработкиЕГАИС.ОшибкаПередачи;
		ВидыСтатусовБазовыйПроцесс.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ПередайтеДанные);
		
		ПараметрыОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.РассчитатьСтатусы(ДокументСсылка, СтатусОбработки, ВидыСтатусовБазовыйПроцесс);
		
	Иначе
		ВызватьИсключение ИнтеграцияЕГАИС.ТекстИсключенияОбработкиСтатуса(ДокументСсылка, ВидСообщения);
	КонецЕсли;
	
	Возврат ПараметрыОбновления;
	
КонецФункции

// Статус после получения данных из ЕГАИС.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.АктПривязкиМарокЕГАИС - Документ, для которого требуется обновить статус.
//  ВидСообщения - ПеречислениеСсылка.ВидыОбъектовЕГАИС - Вид сообщения обмена с ЕГАИС.
//  ДополнительныеПараметры - Неопределено, Структура со свойствами:
//   * СтатусОбработки - Перечисление.СтатусыОбработкиСообщенийЕГАИС - Статус обработки сообщения.
//   * ВидСообщенияКвитанции - ПеречислениеСсылка.ВидыОбъектовЕГАИС - Вид сообщения, на которую получена квитанция.
// 
// Возвращаемое значение:
//  Структура - Структура со свойствами:
//   * НовыйСтатус - ПеречисленияСсылка.ВидыСтатусовОбработкиЕГАИС - Новый статус.
//   * ДальнейшееДействие1 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 1.
//   * ДальнейшееДействие2 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 2.
//   * ДальнейшееДействие3 - ПеречислениеСсылка.ДальнейшиеДействияЕГАИС - Дальнейшее действие 3.
//
Функция СтатусПослеПолученияДанных(ДокументСсылка, ВидСообщения, ДополнительныеПараметры = Неопределено) Экспорт
	
	ХозОперация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "ХозОперация");
	
	ВидыСтатусовБазовыйПроцесс = РегистрыСведений.СтатусыДокументовЕГАИС.СтруктураСтатусы();
	ВидыСтатусовБазовыйПроцесс.Принят           = Перечисления.ВидыСтатусовОбработкиЕГАИС.ПроведенЕГАИС;
	ВидыСтатусовБазовыйПроцесс.Обрабатывается   = Перечисления.ВидыСтатусовОбработкиЕГАИС.ОбрабатываетсяЕГАИС;
	ВидыСтатусовБазовыйПроцесс.ОшибкаПроведения = Неопределено;
	ВидыСтатусовБазовыйПроцесс.Ошибка           = Перечисления.ВидыСтатусовОбработкиЕГАИС.ОшибкаПередачи;
	ВидыСтатусовБазовыйПроцесс.ОшибкаДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ПередайтеДанные);
	ВидыСтатусовБазовыйПроцесс.ПринятДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.НеТребуется);
	ВидыСтатусовБазовыйПроцесс.УведомлениеОРегистрацииДвижения = Ложь;
	
	ВыполнитьРасчетТекущегоСостояния = Истина;
	Если ДополнительныеПараметры <> Неопределено
		И ДополнительныеПараметры.Свойство("ТекущееСостояние")
		И ДополнительныеПараметры.ТекущееСостояние <> Неопределено Тогда
		ВыполнитьРасчетТекущегоСостояния = ДополнительныеПараметры.ТекущееСостояние;
	КонецЕсли;
	
	Если ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.КвитанцияДоставлена Тогда
		
		ВидыСтатусов = Неопределено;
		Если ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.АктФиксацииМарок
			Или ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.АктОтменыФиксацииМарок Тогда
			
			ВидыСтатусов = ВидыСтатусовБазовыйПроцесс;
			
		Иначе
			ВызватьИсключение ИнтеграцияЕГАИС.ТекстИсключенияОбработкиСтатуса(ДокументСсылка, ВидСообщения);
		КонецЕсли;
		
		Если ВидыСтатусов <> Неопределено Тогда
			ПараметрыОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.РассчитатьСтатусыПриПолученииКвитанции(
				ДокументСсылка,
				"КвитанцияДоставлена", ДополнительныеПараметры.СтатусОбработки,
				ВидыСтатусов, ВыполнитьРасчетТекущегоСостояния);
		КонецЕсли;
		
	ИначеЕсли ВидСообщения = Перечисления.ВидыОбъектовЕГАИС.КвитанцияВыполнена Тогда
		
		ВидыСтатусов = Неопределено;
		Если ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.АктФиксацииМарок
			Или ДополнительныеПараметры.ВидСообщенияКвитанции = Перечисления.ВидыОбъектовЕГАИС.АктОтменыФиксацииМарок Тогда
			
			ВидыСтатусов = ВидыСтатусовБазовыйПроцесс;
			
		Иначе
			ВызватьИсключение ИнтеграцияЕГАИС.ТекстИсключенияОбработкиСтатуса(ДокументСсылка, ВидСообщения);
		КонецЕсли;
		
		Если ВидыСтатусов <> Неопределено Тогда
			ПараметрыОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.РассчитатьСтатусыПриПолученииКвитанции(
				ДокументСсылка,
				"КвитанцияВыполнена", ДополнительныеПараметры.СтатусОбработки,
				ВидыСтатусов, ВыполнитьРасчетТекущегоСостояния);
		КонецЕсли;
		
	Иначе
		ВызватьИсключение ИнтеграцияЕГАИС.ТекстИсключенияОбработкиСтатуса(ДокументСсылка, ВидСообщения);
	КонецЕсли;
	
	Возврат ПараметрыОбновления;
	
КонецФункции

// Обновить статус после подготовки к передаче данных
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.АктПривязкиМарокЕГАИС - Ссылка на документ
//  ВидСообщения - ПеречислениеСсылка.ВидыОбъектовЕГАИС - Вид сообщения ЕГАИС
// 
// Возвращаемое значение:
//  Перечисления.ВидыСтатусовОбработкиЕГАИС - Новый статус.
//
Функция ОбновитьСтатусПослеПодготовкиКПередачеДанных(ДокументСсылка, ВидСообщения, ДополнительныеПараметры = Неопределено) Экспорт
	
	ПараметрыОбновления = СтатусПослеПодготовкиКПередачеДанных(ДокументСсылка, ВидСообщения);
	
	Если ПараметрыОбновления = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НовыйСтатусПослеОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.ОбновитьСтатус(
		ДокументСсылка,
		ПараметрыОбновления, ДополнительныеПараметры);
	
	Возврат НовыйСтатусПослеОбновления;
	
КонецФункции

// Обновить статус после передачи данных
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.АктПривязкиМарокЕГАИС - Ссылка на документ
//  ВидСообщения - ПеречислениеСсылка.ВидыОбъектовЕГАИС - Вид сообщения ЕГАИС
//  СтатусОбработки - ПеречислениеСсылка.СтатусыОбработкиСообщенийЕГАИС - Статус обработки сообщения
// 
// Возвращаемое значение:
//  Перечисления.ВидыСтатусовОбработкиЕГАИС - Новый статус.
//
Функция ОбновитьСтатусПослеПередачиДанных(ДокументСсылка, ВидСообщения, СтатусОбработки, ДополнительныеПараметры = Неопределено) Экспорт
	
	ПараметрыОбновления = СтатусПослеПередачиДанных(ДокументСсылка, ВидСообщения, СтатусОбработки);
	
	Если ПараметрыОбновления = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НовыйСтатусПослеОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.ОбновитьСтатус(
		ДокументСсылка,
		ПараметрыОбновления, ДополнительныеПараметры);
	
	Возврат НовыйСтатусПослеОбновления;
	
КонецФункции

// Обновить статус после получения данных из ЕГАИС.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.АктПривязкиМарокЕГАИС - Документ, для которого требуется обновить статус.
//  ВидСообщения - ПеречислениеСсылка.ВидыОбъектовЕГАИС - Вид сообщения обмена с ЕГАИС.
//  ДополнительныеПараметры - Неопределено, Структура со свойствами:
//   * СтатусОбработки - Перечисление.СтатусыОбработкиСообщенийЕГАИС - Статус обработки сообщения.
//   * ВидСообщенияКвитанции - ПеречислениеСсылка.ВидыОбъектовЕГАИС - Вид сообщения, на которую получена квитанция.
// 
// Возвращаемое значение:
//  Перечисления.ВидыСтатусовОбработкиЕГАИС - Новый статус.
//
Функция ОбновитьСтатусПослеПолученияДанных(ДокументСсылка, ВидСообщения, ДополнительныеПараметры = Неопределено) Экспорт
	
	ПараметрыОбновления = СтатусПослеПолученияДанных(ДокументСсылка, ВидСообщения, ДополнительныеПараметры);
	
	Если ПараметрыОбновления = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НовыйСтатусПослеОбновления = РегистрыСведений.СтатусыДокументовЕГАИС.ОбновитьСтатус(
		ДокументСсылка,
		ПараметрыОбновления, ДополнительныеПараметры);
	
	Возврат НовыйСтатусПослеОбновления;
	
КонецФункции

// Получить последовательность операций в течении жизненного цикла документа.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.АктПривязкиМарокЕГАИС - Документ, для которого требуется обновить статус.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - см. функцию ИнтеграцияЕГАИС.ПустаяТаблицаПоследовательностьОпераций().
//
Функция ПоследовательностьОпераций(ДокументСсылка) Экспорт
	
	ХозОперация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "ХозОперация");
	
	Таблица = ИнтеграцияЕГАИС.ПустаяТаблицаПоследовательностьОпераций();
	
	Исходящее = Перечисления.ВходящееИсходящееСобытие.Исходящее;
	Входящее  = Перечисления.ВходящееИсходящееСобытие.Входящее;
	
	Если ХозОперация = Справочники.ХозОперации.АктПривязкиМарокЕГАИС Тогда
		
		ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, 0, Исходящее, Перечисления.ВидыОбъектовЕГАИС.АктФиксацииМарок, ДокументСсылка);
		
	ИначеЕсли ХозОперация = Справочники.ХозОперации.АктОтвязкиМарокЕГАИС Тогда
		
		ИнтеграцияЕГАИС.ДобавитьОперациюВПоследовательность(Таблица, 0, Исходящее, Перечисления.ВидыОбъектовЕГАИС.АктОтменыФиксацииМарок, ДокументСсылка);
		
	КонецЕсли;
	
	Возврат Таблица;
	
КонецФункции

// Обработчик изменения статуса документа.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.АктПривязкиМарокЕГАИС - Документ.
//  ПредыдущийСтатус - ПеречислениеСсылка.ВидыСтатусовОбработкиЕГАИС - Предыдущий статус.
//  НовыйСтатус - ПеречислениеСсылка.ВидыСтатусовОбработкиЕГАИС - Предыдущий статус.
//  ПараметрыОбновленияСтатуса - Структура - см. функцию ИнтеграцияЕГАИС.ПараметрыОбновленияСтатуса().
//
Процедура ПриИзмененииСтатусаДокумента(ДокументСсылка, ПредыдущийСтатус, НовыйСтатус, ПараметрыОбновленияСтатуса) Экспорт
	
	ВидыСтатусовДвижений = ВидыСтатусовДвижений();
	
	ДобавитьДвижения = ИнтеграцияЕГАИС.СтатусТребуетДобавленияДвижений(ВидыСтатусовДвижений, ПредыдущийСтатус, НовыйСтатус);
	УдалитьДвижения = ИнтеграцияЕГАИС.СтатусТребуетУдаленияДвижений(ВидыСтатусовДвижений, ПредыдущийСтатус, НовыйСтатус);
	
	Если ПараметрыОбновленияСтатуса.ОбновлятьДвижения
		И (ДобавитьДвижения Или УдалитьДвижения) Тогда
		
		ДополнительныеСвойстваДляПроведения = Новый Структура;
		ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(ДокументСсылка, ДополнительныеСвойстваДляПроведения);
		
		ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойстваДляПроведения);
		
		НаборЗаписей = РегистрыНакопления.ОстаткиМарокЕГАИС.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
		НаборЗаписей.Загрузить(ДополнительныеСвойстваДляПроведения.ТаблицыДляДвижений["ОстаткиМарокЕГАИС"]);
		НаборЗаписей.Записать();
		
		Если ДополнительныеСвойстваДляПроведения.ТаблицыДляДвижений["ОстаткиМарокЕГАИС"].Количество()>0 Тогда
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
			
			Запрос.Текст = "
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	АктПривязкиМарокМарки.Ссылка КАК Ссылка,
			|	АктПривязкиМарокМарки.ИдентификаторСтроки
			|ПОМЕСТИТЬ
			|	СтрокиПоштучногоУчета
			|ИЗ
			|	Документ.АктПривязкиМарокЕГАИС КАК АктПривязкиМарокЕГАИС
			|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
			|	Документ.АктПривязкиМарокЕГАИС.Марки КАК АктПривязкиМарокМарки
			|ПО
			|	АктПривязкиМарокЕГАИС.Ссылка = &Ссылка И 
			|	АктПривязкиМарокМарки.Ссылка = АктПривязкиМарокЕГАИС.Ссылка И 
			|	АктПривязкиМарокЕГАИС.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.АктПривязкиМарокЕГАИС) И 
			|	(НЕ АктПривязкиМарокМарки.КодМарки = """")
			|ГДЕ
			|	АктПривязкиМарокЕГАИС.Ссылка = &Ссылка И 
			|	АктПривязкиМарокЕГАИС.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.АктПривязкиМарокЕГАИС)
			|;
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	АктПривязкиМарокТовары.Справка2 КАК Справка2
			|ИЗ
			|	СтрокиПоштучногоУчета КАК СтрокиПоштучногоУчета
			|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
			|	Документ.АктПривязкиМарокЕГАИС.Товары КАК АктПривязкиМарокТовары
			|ПО
			|	СтрокиПоштучногоУчета.Ссылка = АктПривязкиМарокТовары.Ссылка И 
			|	СтрокиПоштучногоУчета.ИдентификаторСтроки = АктПривязкиМарокТовары.ИдентификаторСтроки
			|ГДЕ
			|	АктПривязкиМарокТовары.Ссылка = &Ссылка И 
			|	АктПривязкиМарокТовары.Справка2.ПоштучныйУчет = Ложь
			|";
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				Если Не ЗначениеЗаполнено(Выборка.Справка2) Тогда
					Продолжить;
				КонецЕсли;
				Справка2Объект = Выборка.Справка2.ПолучитьОбъект();
				Попытка
					Справка2Объект.Заблокировать();
					Справка2Объект.ПоштучныйУчет = Истина;
					Справка2Объект.Записать();
				Исключение
				КонецПопытки;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Статусы

// Возвращает статусы ошибок.
//
// Возвращаемое значение:
//  Массив - Статусы ошибок.
//
Функция ВидыСтатусовОшибки() Экспорт
	
	ВидыСтатусов = Новый Массив;
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.ОшибкаПередачи);
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.ОшибкаПроведенияЕГАИС);
	
	Возврат ВидыСтатусов;
	
КонецФункции

// Возвращает конечные статусы.
//
// Возвращаемое значение:
//  Массив - Конечные статусы.
//
Функция КонечныеВидыСтатусов() Экспорт
	
	ВидыСтатусов = Новый Массив;
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.Отменен);
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.ОшибкаПроведенияЕГАИС);
	
	Возврат ВидыСтатусов;
	
КонецФункции

// Возвращает запрос для получения статуса оформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Документ основание.
// 
// Возвращаемое значение:
//  Запрос - Запрос для получения статуса оформления.
//
Функция ЗапросСтатусаОформления(ДокументОснование) Экспорт
	
	Запрос = ИнтеграцияЕГАИС.ЗапросСтатусаОформленияДействияНеОпределены();
	Запрос.УстановитьПараметр("КонечныеВидыСтатусовАктПривязкиМарокЕГАИС", КонечныеВидыСтатусов());
	
	Возврат Запрос;
	
КонецФункции

// Возвращает статусы движений.
//
// Возвращаемое значение:
//  Массив - Статусы.
//
Функция ВидыСтатусовДвижений() Экспорт
	
	ВидыСтатусов = Новый Массив;
	ВидыСтатусов.Добавить(Перечисления.ВидыСтатусовОбработкиЕГАИС.ПроведенЕГАИС);
	
	Возврат ВидыСтатусов;
	
КонецФункции

#КонецОбласти

Функция СообщениеКПередачеXML(ДокументСсылка, ДальнейшееДействие, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ДальнейшееДействие = Перечисления.ДальнейшиеДействияЕГАИС.ПередайтеДанные Тогда
		Возврат АктПривязкиМарокЕГАИСXML(ДокументСсылка);
	КонецЕсли;
	
КонецФункции

#КонецЕсли
